Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AdjustCurveTooShort Property
 AdjustCurve is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AdjustCurveTooShort { get; }
Visual Basic
Public Shared ReadOnly Property AdjustCurveTooShort As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AdjustCurveTooShort {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace